* Draft Timeline Panitia HUT RI ke-80 Villa Gardenia

** 🟢 Minggu, 22 Juni – Kickoff
*** Agenda
- Kickoff: Perkenalan [DONE]
- Finalisasi struktur panitia [DONE]
- Draft List Lomba
- Penentuan timeline
**** Knowledge Base:
#+begin_src bash :results none
firefox https://villa-gardenia.github.io/hut-ri/history/donation.html
#+end_src

*** PIC:
- Event Director
- Deputy Director
- Secretary
- Public Relations Coordinator


** 🟡 Jumat, 28 Juni (8 Pagi)
*** Agenda
- Rapat Penyusunan Anggaran
- Pembahasan dan Penetapan Proposal
*** PIC:
- Fundraising & Sponsorship Coordinator
- Program Director
- Talent Coordinator
- F&B Coordinator
- Logistics & Equipment Coordinator
- Fundraising & Sponsorship Coordinator
- Games, Competitions, Prize & Giveaway Lead


** 🟡 Sabtu, 28 Juni
*** Agenda
- Design dan Cetak Proposal
- Pembuatan Google Form Lomba
- Draft Google Form Lomba
- Ide untuk Teaser
- Pembuatan IG Paguyuban Villa Gardenia
*** PIC:
- Creative Director
- Documentation Team
- Promotion Lead

** 🟡 Minggu, 29 Juni
*** Agenda
- Deadline Design Awal
- Cetak Proposal dan Desain Kreatif lainnya

** 🟡 Senin, 30 Juni
*** Target
- Mulai Distribusi Proposal
- Mulai Distribusi Google Form Lomba

-----DRAFT----

** 🟡 5–6 Juli
*** Agenda
- Penyebaran undangan cetak dan Google Form lomba
- Pembelian properti awal lomba (tali, kerupuk, bambu, dll)
*** PIC:
- Program Director
- Games, Competitions, Prize & Giveaway Lead
- F&B Coordinator

** 🟡 12–13 Juli
*** Agenda
- Booking vendor: panggung, sound system, kursi, tenda
- Pemetaan lokasi lomba berdasarkan blok
- Cetak kupon, sertifikat, banner
- Logistics & Equipment Coordinator
- Venue & Decoration Coordinator
*** PIC:
- Creative Director
- Games, Competitions, Prize & Giveaway Lead

** 🟠 19–20 Juli
*** Agenda
- Pembelian hadiah lomba
- Publikasi materi lomba ke warga
- Finalisasi konsumsi (vendor atau gotong royong)
*** PIC:
- Program Director
- F&B Coordinator
- Promotion Lead
- Master of Ceremony

** 🟠 26–27 Juli
*** Agenda
- Pemasangan dekorasi awal: gapura, bendera, papan nama
- Reminder daftar lomba dan kontribusi donasi
- Latihan pentas seni dimulai
*** PIC:
- Venue & Decoration Coordinator
- Talent Coordinator
- Documentation Team
- Public Relations Coordinator

** 🔴 2–3 Agustus
*** Agenda
- Pelaksanaan lomba anak-anak dan lomba ringan
- Penutupan Google Form pendaftaran
- Finalisasi pembagian shift konsumsi
- Games, Competitions, Prize & Giveaway Lead
- F&B Coordinator
*** PIC:
- Documentation Team
- Safety & Crowd Control Officer
- Volunteer Coordinator

** 🔴 9–10 Agustus
*** Agenda
- Sabtu: Lomba dewasa dan keluarga (panjat pinang, tarik tambang, dll)
- Minggu: Jalan sehat pagi hari, bungkus hadiah, gladi tasyakuran
- Games, Competitions, Prize & Giveaway Lead
*** PIC:
- Documentation Team
- Safety & Crowd Control Officer
- Program Director

** 🔴 16 Agustus (Sabtu – H-1)
*** Agenda
- Pemasangan dekorasi penuh di seluruh titik acara
- Distribusi snack kering dan persiapan konsumsi
- Malam: Tasyakuran & Pentas Seni
*** PIC: @all

** ⚪ 17 Agustus (Minggu – Hari Kemerdekaan)
*** Agenda
- *Tidak ada acara publik*
- Upload dokumentasi, evaluasi internal, dan refleksi
*** PIC:
- Documentation Team
- Promotion Lead
- Secretary


* Helper

** Search PIC Name

#+name: PIC Name
#+begin_src bash :results output :wrap example
grep -A3 "Deden" ./README.md | sed s/\#\#\#/*/g
#+end_src

#+RESULTS: PIC Name
#+begin_example
,* 👤 Ketua Panitia (Event Director) – Deden Bangkit

Memimpin seluruh panitia, menyusun struktur organisasi, menentukan jadwal rapat, memantau progres masing-masing seksi, serta mengambil keputusan strategis yang mendukung kelancaran acara.

#+end_example

** Search Message

#+name: Search Message
#+begin_src bash :results output :wrap example
grep "ZZZ" ~/Documents/VG/WhatsappChat/180625-last-clean-chat.csv
#+end_src

#+RESULTS: Search Message
#+begin_example
#+end_example
